In [37]:
import pandas as pd
import numpy as np
import re

In [ ]:
dfz = pd.read_csv("raw_data/zomato_dataset.csv")

In [39]:
dfz.head()

,Restaurant Name,Dining Rating,Delivery Rating,Dining Votes,Delivery Votes,Cuisine,Place Name,City,Item Name,Best Seller,Votes,Prices
0,Doner King,3.9,4.2,39,0,Fast Food,Malakpet,Hyderabad,Platter Kebab Combo,BESTSELLER,84,249.0
1,Doner King,3.9,4.2,39,0,Fast Food,Malakpet,Hyderabad,Chicken Rumali Shawarma,BESTSELLER,45,129.0
2,Doner King,3.9,4.2,39,0,Fast Food,Malakpet,Hyderabad,Chicken Tandoori Salad,NaN,39,189.0
3,Doner King,3.9,4.2,39,0,Fast Food,Malakpet,Hyderabad,Chicken BBQ Salad,BESTSELLER,43,189.0
4,Doner King,3.9,4.2,39,0,Fast Food,Malakpet,Hyderabad,Special Doner Wrap Combo,MUST TRY,31,205.0

In [40]:
dfz.tail()

,Restaurant Name,Dining Rating,Delivery Rating,Dining Votes,Delivery Votes,Cuisine,Place Name,City,Item Name,Best Seller,Votes,Prices
123652,Ariena Boutique Hotel,3.9,4.2,13,523,Pizza,Purena,Raipur,Murgh Reshmi Kebab,NaN,0,525.0
123653,Ariena Boutique Hotel,3.9,4.2,13,523,Pizza,Purena,Raipur,Murgh Large Tikka,NaN,0,525.0
123654,Ariena Boutique Hotel,3.9,4.2,13,523,Pizza,Purena,Raipur,Murgh Chukandri Tikka,NaN,0,525.0
123655,Ariena Boutique Hotel,3.9,4.2,13,523,Pizza,Purena,Raipur,Murgh Golden Kebab,NaN,0,525.0
123656,Ariena Boutique Hotel,3.9,4.2,13,523,Pizza,Purena,Raipur,Gosht Gilawat Chop,BESTSELLER,0,595.0

In [41]:
dfz.isnull().any()

Restaurant Name    False
Dining Rating       True
Delivery Rating     True
Dining Votes       False
Delivery Votes     False
Cuisine            False
Place Name         False
City               False
Item Name          False
Best Seller         True
Votes              False
Prices             False
dtype: bool

In [42]:
dfz.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 123657 entries, 0 to 123656
Data columns (total 12 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   Restaurant Name  123657 non-null  object
 1   Dining Rating    91421 non-null   float64
 2   Delivery Rating  122377 non-null  float64
 3   Dining Votes     123657 non-null  int64
 4   Delivery Votes   123657 non-null  int64
 5   Cuisine          123657 non-null  object
 6   Place Name       123657 non-null  object
 7   City             123657 non-null  object
 8   Item Name        123657 non-null  object
 9   Best Seller      27942 non-null   object
 10  Votes            123657 non-null  int64
 11  Prices           123657 non-null  float64
dtypes: float64(3), int64(3), object(6)
memory usage: 11.3+ MB

In [47]:
dfz.columns = dfz.columns.str.lower().str.replace(" ", "_")

In [48]:
dfz.columns

Index(['restaurant_name', 'dining_rating', 'delivery_rating', 'dining_votes',
       'delivery_votes', 'cuisine_', 'place_name', 'city', 'item_name',
       'best_seller', 'votes', 'prices'],
      dtype='object')

In [44]:
dfz.shape

(101530, 12)

In [50]:
df = dfz.groupby(
    ['restaurant_name', 'dining_rating', 'cuisine_', 'place_name', 'city']
).agg({
    "item_name": lambda x: ", ".join(sorted(x.unique())),
    "prices": "median"
}).reset_index()

In [51]:
df.head()

,restaurant_name,dining_rating,cuisine_,place_name,city,item_name,prices
0,12 To 12 BBQ,4.0,Biryani,Panampilly Nagar,Kochi,"12 to 12 Fried Chicken with Garlic Rice, Afgha...",280.0
1,1944 -The HOCCO Kitchen,4.3,Shake,Navrangpura,Ahmedabad,Ahmedabadi Style Pizza (Thin Curst Only) (25 C...,249.0
2,4M Biryani House,4.1,Chinese,Musheerabad,Hyderabad,"Afghani Beef, Afghani Chicken, Apollo Fish, Be...",185.0
3,99 Pancakes,3.8,Beverages,Matunga East,Mumbai,1 Chocolate Lovely Pancakes (6pcs) + 1 Chocola...,164.5
4,99 Variety Dosa & Pav Bhaji,3.9,Maharashtrian,Koramangala 6th Block,Bangalore,"All Mix Cheese Veg Dosa, All Mix Veg Dosa, All...",115.0

In [57]:
df.tail()

,restaurant_name,rating,cuisines,place_name,city,menu_list,prices
615,Zafar's Fine Dine,3.9,Desserts,Tolichowki,Hyderabad,"Achari Chicken, Achari Fish Tikka, Achari Gosh...",340.0
616,Zaffran Mataam Alarabi,4.1,Desserts,Falaknuma,Hyderabad,"Chicken Al Faham Mandi [Half Bird], Chicken Gr...",805.0
617,Zam Zam Briyani,3.3,North Indian,Choolaimedu,Chennai,"Beef Biryani, Beef Hyderabadi Biryani, Beef Ma...",169.0
618,Zam Zam Restaurant,4.2,Pizza,Park Circus Area,Kolkata,"Aloo Biryani, Aloo Biryni, Basmati Rice, Beef ...",190.0
619,Zeeshan Biryani Corner,3.7,Biryani,Lalbagh,Lucknow,"Afghani Chicken Tikka, Butter Chicken, Chicken...",190.0

In [64]:
df.columns

Index(['restaurant_name', 'rating', 'cuisines', 'place_name', 'city',
       'menu_list', 'prices'],
      dtype='object')

In [56]:
df.rename(columns={
    'dining_rating': 'rating',
    'cuisine_': 'cuisines',
    'item_name': 'menu_list'
}, inplace=True)

In [68]:
df['restaurant_name'] = df['restaurant_name'].astype(str).str.strip()
df['city'] = df['city'].astype(str).str.strip()
df['place_name'] = df['place_name'].astype(str).str.strip()

In [ ]:
# SAVE CLEAN FILE
df.to_csv("raw_data/zomato_india.csv", index=False)

print("CLEANED SHAPE:", df.shape)

CLEANED SHAPE: (620, 7)